# TemperatureValue Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
InitialColor..::..TemperatureValue Property
InitialColor Class See Also
---
The light color temperature value in Kelvins.
**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double TemperatureValue { get; }
```

Visual Basic
---
```text
Public ReadOnly Property TemperatureValue As Double
	Get
```

Visual C++
---
```text
public:
property double TemperatureValue {
	double get ();
}
```

# See Also
InitialColor Class
Autodesk.Revit.DB.Lighting Namespace